Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: For this grouping operator there is no need to describe the ordering, since only whether or not C<S> can match is important.
es: Para este operador de agrupación no hay necesidad de describir el orden, ya que sólo es importante si C<S> puede coincidir.

source: For this to be valid, the formatter class must provide such a method, and the value you pass should be valid.
es: Para que esto funcione, la clase de formateador debe proporcionar este método y el valor pasado debe ser válido

source: For this you'll need a shell script for C<git> to call to test a particular revision.
es: Para ello necesitará un script de shell que haga que C<git> llame una revisión concreta para realizar pruebas.

source: For various reasons C<\K> may be significantly more efficient than the equivalent C<< (?<=...) >> construct, and it is especially useful in situations where you want to efficiently remove something following something else in a string.
es: Por diversas razones, C<\K> puede ser considerablemente más eficiente que la construcción equivalente C<< (?<=...) >>, y resulta especialmente útil en situaciones en las que se desea quitar algo que siga a otra cosa, dentro de una cadena.

source: For various reasons, Perl is probably not well-suited for real-time embedded systems, low-level operating systems development work like device drivers or context-switching code, complex multi-threaded shared-memory applications, or extremely large applications.
es: Por diversos motivos, es probable que Perl no sea adecuado para sistemas incrustados en tiempo real, trabajo de desarrollo de sistemas operativos a bajo nivel, como controladores de dispositivos o código de cambio de contexto de hilos de ejecución, aplicaciones complejas de memoria compartida y múltiples hilos de ejecución, o aplicaciones extremadamente grandes.

source: Forcing a numeric value to a particular format does not change the number stored in the value.
es: Forzar la conversión de un valor numérico a un formato específico no cambia el número almacenado en el valor.

source: Fortunately, Perl handles this for us, so we don't have to worry about this.
es: Afortunadamente, Perl se encarga de esto.

source: Fortunately, Perl's flexibility has allowed a rich ecosystem of Perl OO systems to flourish.
es: Afortunadamente, la flexibilidad de Perl ha permitido que florezca un variado ecosistema de sistemas orientados a objetos en el lenguaje.

source: FreeBSD 7 and earlier has a bug where either approach sometimes returns an incorrect value (see http://www.freebsd.org/cgi/query-pr.cgi?pr=35703 ).
es: En FreeBSD 7 y versiones anteriores había un error que hacía que, a veces, cualquiera de las dos formas mencionadas de obtener la ruta devolviera un valor incorrecto (vea http://www.freebsd.org/cgi/query-pr.cgi?pr=35703 ).

source: Frequently Asked Question (although not necessarily frequently answered, especially if the answer appears in the Perl FAQ shipped standard with Perl).
es: Preguntas más frecuentes (aunque no necesariamente frecuentemente contestadas, especialmente si la respuesta ya aparece en los documentos de preguntas más frecuentes sobre Perl que se incluyen en la distribución estándar de Perl).

source: From Greek, "with-arrangement".
es: Viene del griego y significa "con orden".

source: From Swift: someone who eats eggs big end first.
es: Según Swift, alguien que empieza a comer un huevo por su extremo más ancho (juego de palabras; en inglés "end" significa extremo).

source: From Swift: someone who eats eggs little end first.
es: Según Swift, alguien que empieza a comer un huevo por su extremo menos ancho (Nota del traductor: juego de palabras; en inglés "end" significa extremo).

source: From the menus there, you can upload your module to CPAN.
es: Puede usar los menús de PAUSE para subir el módulo a CPAN.

source: From this we can determine that Perl is different things to different people, but that lots of people think it's at least worth writing about.
es: Esto refleja el hecho de que, aunque Perl tiene muchos públicos distintos, muchas personas piensan que merece la pena escribir sobre este lenguaje.

source: From websites, to IRC, to mailing lists, there is more than one way to get involved in the community.
es: Existen varias maneras de involucrarse en la comunidad: sitios web, IRC, listas de correo, etc.

source: Function and method names seem to work best as all lowercase.
es: Para los nombres de funciones y métodos es mejor usar minúsculas.

source: Functions that want a L</LIST> of arguments tell those arguments that they should produce a list value.
es: Las funciones que consumen una L</LISTA> de argumentos indican a esos argumentos que deben producir un valor de lista.

source: Furthermore, the CPAN (which didn't exist at the time of Perl 5.0) can become the new home of dropped modules.
es: Por otra parte, ahora existe CPAN (no existía cuando salió Perl 5.0), que puede convertirse en el nuevo hogar de los módulos suprimidos de la distribución.

source: Future versions of Perl are likely to eliminate these arbitrary limitations.
es: Es probable que estas limitaciones arbitrarias se eliminen en futuras versiones de Perl.

source: General (not help-oriented) chat can be found at L<irc://irc.perl.org/#perl>.
es: Un sitio de charla informal (no precisamente orientado a ayudar) se encuentra en L<irc://irc.perl.org/#perl>.

source: Generally you shouldn't try this on roller coasters.
es: En general, no debe probar esto en una montaña rusa.

source: Generally, a collection of procedures.
es: Generalmente es una colección de procedimientos.

source: Generally, any L</token> or L</metasymbol>.
es: Generalmente, cualquier L</token> o L</metasímbolo>.

source: Generally, the first character in the sequence must be a true metacharacter to get the other characters in the metasymbol to misbehave along with it.
es: En general, el primer carácter de la secuencia debe ser un auténtico metacarácter para que los demás caracteres del metasímbolo le sigan en sus fechorías.

source: Generally, you can use B<roles> to do everything you can do with multiple inheritance, but in a cleaner way.
es: En general, pueden usarse B<roles> para conseguir todo lo ofrecido por la herencia múltiple, pero de forma mucho más limpia.

source: Get the EMX development suite and gzip/tar, from either Hobbes ( http://hobbes.nmsu.edu ) or Leo ( http://www.leo.org ), and then follow the instructions for Unix.
es: Obtenga el paquete de desarrollo EMX y gzip/tar en Hobbes ( http://hobbes.nmsu.edu ) o Leo ( http://www.leo.org ), y siga las instrucciones para Unix.

source: Git will start up your favorite text editor, so that you can craft a commit message for your change.
es: Git abrirá su editor de texto favorito para que redacte un mensaje de confirmación para el cambio.

source: Giving additional meanings to a symbol or construct.
es: Otorgar significados adicionales a un símbolo o una construcción.

source: Global destruction should not be confused with the Apocalypse, except perhaps when it should.
es: La destrucción global no debe confundirse con el Apocalipsis, salvo cuando se refiera a eso explícitamente.

source: Global matching, and keep the Current position after failed matching.
es: C<g> realiza una detección de coincidencias global y C<c> conserva la posición actual tras un error de detección de coincidencia.

source: Global variables can be declared with L<our|perlfunc/our>.
es: Las variables globales se pueden declarar con L<our|perlfunc/our>.

source: Go figure.
es: No hay quien lo entienda...

source: Go into the newly-created directory and type:
es: Entre en el directorio que acaba de crear y escriba:

source: Good error messages should go to C<STDERR>, include which program caused the problem, what the failed system call and arguments were, and (VERY IMPORTANT) should contain the standard system error message for what went wrong.
es: Para que un mensaje de error se considere correcto, debe salir por C<STDERR>, especificar el programa que causó el problema y la función del sistema (y sus argumentos) que provocó el error, y (MUY IMPORTANTE) contener el mensaje de error estándar del sistema que indique qué salió mal.

source: Good hackers are not to be confused with evil L<crackers|/cracker> or clueless L<script kiddies|/script kiddie>.
es: No se deben confundir los buenos hackers con los malvados L<crackers|/cracker> ni con los limitados L<script kiddies|/script kiddie>.

source: Google "larry wall quotes"!
es: Busque "larry wall quotes" en Google.

source: Graham 5.005_03-MT1 1998-Nov-30 5.005_03-MT2 1999-Jan-04 5.005_03-MT3 1999-Jan-17 5.005_03-MT4 1999-Jan-26 5.005_03-MT5 1999-Jan-28 5.005_03-MT6 1999-Mar-05 5.005_03 1999-Mar-28
es: Graham 5.005_03-MT1 1998-Nov-30 5.005_03-MT2 1999-Ene-04 5.005_03-MT3 1999-Ene-17 5.005_03-MT4 1999-Ene-26 5.005_03-MT5 1999-Ene-28 5.005_03-MT6 1999-Mar-05 5.005_03 1999-Mar-28

source: Grandparent
es: Abuelo

source: Group ID--in Unix, the numeric group ID that the L</operating system> uses to identify you and members of your L</group>.
es: Group ID (identificador de grupo). En Unix es el identificador de grupo numérico que el L</sistema operativo> usa para identificarle a usted y a los miembros de su L</grupo>.

source: Groups are numbered with the leftmost open parenthesis being number 1, etc. If a group did not match, the associated backreference won't match either.
es: Los grupos se numeran, siendo el paréntesis abierto más a la izquierda el número 1, etc. Si no se detecta un grupo, no se inicializará la retrorreferencia asociada.

source: Hackathons are a very different kind of gathering where Perl hackers gather to do just that, hack nonstop for an extended (several day) period on a specific project or projects.
es: Un I<hackathon> es un tipo de encuentro muy diferente, donde los I<hackers> de Perl se reúnen para hacer lo que el nombre sugiere: I<hackear> (trabajar) sin parar durante un período prolongado (que puede ser de varios días) en un determinado proyecto (o proyectos).

source: Hacker is a neutral term, morally speaking.
es: Hacker es un término neutro, desde un punto de vista ético.

source: Half a L</byte>, equivalent to one L</hexadecimal> digit, and worth four L<bits|/bit>.
es: La mitad de un L</byte>, equivalente a un dígito L</hexadecimal> y que representa cuatro L<bits|/bit>.

source: Hash subscripts are similar, only instead of square brackets curly brackets are used.
es: Los índices en los hashes son similares, pero en lugar de corchetes se usan llaves.

source: Hashes are unordered collections of scalar values indexed by their associated string key.
es: Los hashes son colecciones no ordenadas de valores escalares indexadas por sus claves asociadas, que son cadenas de caracteres.

source: Hashes have no particular internal order, though you can sort the keys and loop through them.
es: En los hashes no hay un orden interno específico, aunque puede ordenar las claves antes de recorrerlas en un bucle.

source: Have a good plough through the L<http://search.cpan.org> and make sure you're not the one reinventing the wheel!
es: Investigue a fondo en L<http://search.cpan.org> y asegúrese de que no va a reinventar la rueda.

source: Having PERLDOCDEBUG set to a positive integer will make perldoc emit even more descriptive output than the C<-v> switch does; the higher the number, the more it emits.
es: Si se establece como valor de PERLDOCDEBUG un entero positivo, perldoc emitirá una salida aún más descriptiva que la que proporciona el modificador C<-v>; cuanto mayor sea el número, más información emitirá.

source: Having a meaning.
es: Que tiene un significado.

source: Having to do with numbers represented in base 2.
es: Que tiene que ver con números representados en base 2.

source: He previously used the phrase with many subjects ("Just another x hacker,"), so to distinguish his JAPH, he started to write them as Perl programs:
es: Previamente había utilizado esta frase con muchos sujetos distintos ("Just another x hacker,"), así que para distinguir su JAPH decidió empezar a escribir la firma como un programa Perl:

source: He says (half in jest) that "a script is what you give the actors.
es: Dice (medio en broma) que "un script (guión) es lo que se le da a los actores,

source: Hence Tom's quip that "Nothing but perl can parse Perl."
es: Ésta es la razón por la que Tom dice que "solo perl puede analizar Perl".

source: Hence the C<import> and C<unimport> routines are called at B<compile time> for the user's code.
es: Así, las rutinas C<import> y C<unimport> se llaman en B<tiempo de compilación> para el código del usuario.

source: Hence, an asynchronous event is one you didn't know when to expect.
es: Así, un evento asincrónico es un evento que puede suceder en cualquier momento, pero no se sabe cuándo.

source: Hence, if you have created a temporary value that you keep no pointer to, C<sv_2mortal()> to ensure that it is disposed of correctly.
es: Por lo tanto, si ha creado un valor temporal al que no apunta ningún puntero, use C<sv_2mortal()> para asegurarse de que se elimina de la manera correcta.

source: Hence, the first great virtue of a programmer.
es: Por esta razón, la consideremos la primera gran virtud de un programador.

source: Hence, the second great virtue of a programmer.
es: Es por ello la segunda gran virtud de un programador.

source: Hence, the third great virtue of a programmer.
es: Es por ello la tercera gran virtud de un programador.

source: Here are commonly expected conventions:
es: Las convenciones habituales son:

source: Here are some examples of how that works on an ASCII platform:
es: Veamos algunos ejemplos de cómo funciona esto en una plataforma ASCII:

source: Here are some other more substantive style issues to think about:
es: A continuación se muestran otras cuestiones de estilo más importantes que conviene tener en mente:

source: Here are some statistics for the other subdirectories and one file in the Perl source distribution for somewhat more selected releases.
es: A continuación se muestran algunas estadísticas para los demás subdirectorios y un archivo de la distribución de código fuente de Perl de algunas versiones más significativas.

source: Here are some variants, most of which don't work:
es: Veamos otras variantes, la mayoría de las cuales tampoco funcionarán:

source: Here are the statistics for Perl 5.005_62 on my system:
es: Estas son las estadísticas correspondientes a Perl 5.005_62 en mi sistema:

source: Here is a DBM Filter that does it:
es: El siguiente filtro DBM hace esto:

source: Here is a guide to merging patches from a GitHub repository.
es: A continuación se ofrece una guía breve para combinar parches de un repositorio de GitHub.

source: Here is a simple constructor:
es: Veamos un ejemplo de constructor sencillo:

source: Here is a simple example of the technique, using the L<Hash::Util::FieldHash> core module.
es: Veamos un ejemplo simple de esta técnica, basado en el módulo L<Hash::Util::FieldHash> del núcleo.

source: Here is an example of backtracking: Let's say you want to find the word following "foo" in the string "Food is on the foo table.":
es: Veamos un ejemplo de vuelta atrás: suponga que desea encontrar la palabra que sigue a "come" en la cadena "En el Comedor Principal el niño come espinacas.":

source: Here is another real-life example.
es: Otro ejemplo del mundo real:

source: Here is our C<File> class using C<Moose>:
es: El código de nuestra clase C<Archivo> con C<Moose> sería:

source: Here it's more effective to use minimal matching to make sure you get the text between a "foo" and the first "bar" thereafter.
es: Aquí es más eficaz utilizar una coincidencia mínima para asegurarse de obtener el texto entre una instancia de "mesa" y la primera instancia de "come" que haya a continuación.

source: Here's a regular expression: C</Oh s.*t./>.
es: Ejemplo de expresión regular: C</Ast.*ores/>.

source: Here's a brief recap of the options we covered:
es: A continuación se ofrece un breve resumen de las opciones consideradas:

source: Here's a clearer picture of why that pattern matches, contrary to popular expectations:
es: Veamos una explicación más clara de por qué ese patrón produce una coincidencia, en contra de lo esperado:

source: Here's a simple but sufficient example:
es: Un ejemplo sencillo pero suficiente sería:

source: Here's a simple example being:
es: Veamos un ejemplo sencillo:

source: Here's a summary of the possible predicates:
es: A continuación se muestra un resumen de los predicados posibles:

source: Here's an example of a module as a blessed scalar:
es: Veamos un ejemplo de módulo basado en un escalar bendecido:

source: Here's an example of where not running the suite caused problems.
es: En el caso que se describe a continuación, hubo problemas por no ejecutar la batería de pruebas.

source: Here's another example.
es: Veamos otro ejemplo:

source: Here's how to perform each step for each operating system.
es: Veamos cómo se realizan estos pasos en los distintos sistemas operativos.

source: Here's how you get at elements in an array:
es: Para obtener los elementos de un array:

source: Here's our "class declaration" for the C<File> class:
es: A continuación se muestra la "declaración de la clase" C<Archivo>:

source: Here's our C<File> class once more:
es: Nuestra clase C<Archivo> sería:

source: Here's our C<File> class with C<Class::Accessor>:
es: La clase C<Archivo> con C<Class::Accessor> sería:

source: Here's some of the thing you'll find in it:
es: Contiene cosas como:

source: Here's something Larry suggested: if a C<U> is the first active format during a C<pack>, (for example, C<pack "U3C8", @stuff>) then the resulting string should be treated as UTF-8 encoded.
es: Para ello, nos ocuparemos de implementar algo que propuso Larry: si el primer formato activo en una instrucción C<pack> es C<U> (por ejemplo, C<pack "U3C8", @algo>), entonces la cadena resultante debería tratarse como codificada en UTF-8.

source: Here's what happens: when Perl reads in a string literal, it sticks to 8 bit encoding as long as it can.
es: Lo que sucede es esto: cuando Perl lee un literal de cadena, mantendrá una codificación de 8 bits mientras pueda

source: Here, you don't have characters, just bytes.
es: Contienen bytes, no caracteres.

source: Hexadecimal constants in Perl start with C<0x>.
es: En Perl, las constantes hexadecimales empiezan por C<0x>.

source: Hexadecimal, octal, or binary, representations in string literals (e.g. '0xff') are not automatically converted to their integer representation.
es: Las representaciones hexadecimales, octales o binarias en cadenas literales (por ejemplo, '0xff') no se convierten automáticamente en su representación en enteros.

source: Hiding or invalidating some other definition of the same name.
es: Ocultar o invalidar otra definición con el mismo nombre.

source: Hint: you could say C<open(LOG,'logfile')> rather than C<open(log,'logfile')>.
es: Un consejo: es mejor escribir C<open(LOG,'archivo_log')> que C<open(log,'archivo_log')>.

source: His UTF-8 rants during the Amsterdam Perl Mongers meetings got me interested and determined to find out how to use character encodings in Perl in ways that don't break easily.
es: Sus diatribas contra UTF-8 en las reuniones de los Amsterdam Perl Mongers hicieron que me interesara por el tema y me propusiera aprender a utilizar de una manera segura las codificaciones de caracteres en Perl.

source: His presentation "UTF-8 in the wild" (Dutch Perl Workshop 2006) inspired me to publish my thoughts and write this tutorial.
es: Su presentación "UTF-8 in the wild" (Dutch Perl Workshop 2006) me sirvió de inspiración para publicar mis ideas y escribir este tutorial.

source: Historically, any software that you give away, particularly if you make the source code available as well.
es: Históricamente, cualquier software que se regala, especialmente si también se incluye el código fuente.

source: Historically, characters were usually stored as fixed-width integers (typically in a byte, or maybe two, depending on the character set), but with the advent of UTF-8, characters are often stored in a variable number of bytes depending on the size of the integer that represents the character.
es: Históricamente, los caracteres normalmente se almacenaban como enteros de ancho fijo (normalmente en un byte, o quizás en dos, en función del juego de caracteres); sin embargo, desde que surgió UTF-8, los caracteres se suelen almacenar en un número variable de bytes, en función del tamaño del entero que representa el carácter.

source: Hopefully the contents of each of the filters should be self-explanatory.
es: El contenido de cada filtro debe ser autodescriptivo.

source: How a piece of code actually goes about doing its job.
es: La manera en que un fragmento de código hace su trabajo.

source: How can I build my own Perl interpreter?
es: ¿Cómo puedo compilar mi propio intérprete de Perl?

source: How do I make it work?
es: ¿Cómo puedo hacer que funcione?

source: How do we know if the C<U> is the first format in the C<pat>?
es: ¿Cómo sabemos si la C<U> es el primer formato en C<pat>?

source: How do we prepare to fix this up?
es: ¿Cómo nos preparamos para corregir esto?

source: How far away you can see a variable from, looking through one.
es: Lo que es visible desde una variable.

source: How many things you have to skip over when moving from the beginning of a string or array to a specific position within it.
es: El número de elementos que debe saltar al moverse desde el principio de una cadena o un array a una posición específica.

source: How things (particularly symbols) are put together with each other.
es: Especifica cómo deben disponerse las cosas (en particular, los símbolos).

source: How you use it determines whether it is interpreted as all or only one of them.
es: El uso que le dé determinará si se interpreta como todas las opciones o como una sola de ellas.

source: How your various pieces of data relate to each other and what shape they make when you put them all together, as in a rectangular table or a triangular-shaped tree.
es: Manera en que diversos elementos de datos están relacionados entre sí y forma que adquieren cuando se colocan todos juntos (por ejemplo, en una tabla rectangular o en un árbol de forma triangular).

source: However if you'd like to override that just for perl then execute then execute something like the following in F<perl>:
es: Sin embargo, si desea sobrescribir esa configuración solo para perl, debe ejecutar algo parecido a lo siguiente en F<perl>:

source: However the parent classes are set, the package's C<@ISA> variable will contain a list of those parents.
es: Independientemente de cómo se establezcan las clases primarias, la variable C<@ISA> del paquete contendrá la lista de dichas clases primarias.

source: However, "native" floats have a most fundamental restriction: they may represent only those numbers which have a relatively "short" representation when converted to a binary fraction.
es: En cambio, existe una restricción intrínseca para los números de punto flotante "nativos": solo se pueden representar los números que tengan una representación relativamente "corta" al convertirse en una fracción binaria.

source: However, C<print()> can also take an optional first argument specifying which filehandle to print to:
es: Sin embargo, C<print()> también puede consumir un primer argumento opcional que especifique el identificador de archivo en el que se debe imprimir:

source: However, OO Perl is largely beyond the scope of this document.
es: Sin embargo, este tema queda fuera del ámbito de este documento.
